from kivy.uix.label import Label

lbl_scr1 = Label(text = "Ця програма дозволить вам за допомогою тесту Руф'є провести первину діагностику вашого здоров'я" + "\n" 
                    + "\n"
                    + "Проба Руф'є являє собою навантажувальний комплекс призначений для оцінки працездатності серця при фізичному навантаженні." + "\n"
                    + "У випробуваного визначають частоту пульсу за 15 секунд." + "\n"
                    + "Потім протягом 45 секунд випробуваний виконує 30 присідань." + "\n"
                    + "\n"
                    + "Після закінчення навантаження пульс підраховується знову: число пульсацій за перші 15 секунд та 30 секунд відпочинку та число пульсацій за останні 15 секунд.",
                    pos_hint={"center_x": 0.5, "center_y": 0.2}, font_size = (15))


name_scr1 = Label(text="Введіть імя", pos_hint={"center_x": 0.5, "center_y": 0.2}, font_size = (24))
age_scr1 = Label(text="Введіть вік", pos_hint={"center_x": 0.5, "center_y": 0.2}, font_size = (24))



lbl_scr2 = Label (text = "Виміряйте пульс за 15 секунд." + "\n"
                + "Результат запишіть в відповідне поле.")
result_scr2 = Label (text = "Введіть результат:")


ecran3_txt = Label(text = "Виконайте 30 присідань за 45 секунд.")


lbl_scr4 = Label(text="протягом хвилини затримайте пульс двічі:" + "\n"
                 + "\n"
                 + "за перші 15 секунд хвилини, потім за останні 15 секунд." + "\n"
                 + "\n" 
                 + "Результати запишіть у выдповідны поля.", 
                 pos_hint={"center_x": 0.5, "center_y": 0.2}, font_size = (24))

result_scr4 = Label(text='Результат:')
result2_scr4 = Label(text='Результат після відпочинку:')
